<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download the latest version of Lego WeDo, then packages it</string>
        <key>Identifier</key>
        <string>com.github.sebtomasi.pkg.legoWeDo</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Lego WeDo</string>
            <key>DL_URL</key>
            <string>https://le-www-live-s.legocdn.com/downloads/WeDo2</string>
            <key>SEARCH_PATTERN</key>
            <string>(WeDo2_Full_[\d.]+_Global_OSX.pkg)</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.3</string>
        <key>ParentRecipe</key>
	    <string>com.github.sebtomasi.download.legoWeDo</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>source_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/*.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>com.github.sebtomasi.SharedProcessors/TextSubstituer</string>
                <key>Arguments</key>
			    <dict>
                    <key>input_string</key>
                    <string>%found_filename%</string>
                    <key>pattern_replace</key>
                    <array>
                        <dict>
                            <key>pattern</key>
                            <string>_Global_OSX</string>
                            <key>repl</key>
                            <string></string>
                        </dict>
                        <dict>
                            <key>pattern</key>
                            <string>_Full_</string>
                            <key>repl</key>
                            <string>-</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileMover</string>
                <key>Arguments</key>
                <dict>
                    <key>source</key>
                    <string>%found_filename%</string>
                    <key>target</key>
                    <string>%parsed_string%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
