<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Silhouette Studio and creates a package, then uploads it to jss</string>
        <key>Identifier</key>
        <string>com.github.sebtomasi.jss.SilhouetteStudio</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Silhouette Studio</string>
            <key>DL_URL</key>
            <string>http://silhouettefr.fr/file</string>
            <key>SEARCH_PATTERN</key>
            <string>(Version [\d.]+)</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
            <key>CATEGORY</key>
            <string></string>
            <key>DESCRIPTION</key>
            <string>Le Logiciel Silhouette Studio ® vous donne la possibilité de concevoir des projets pour découper sur n'importe quelle machine de découpe électronique Silhouette.</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/%NAME%.png</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>version</key>
            <string></string>
            <key>pkg_path</key>
            <string></string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
	    <string>com.github.sebtomasi.pkg.SilhouetteStudio</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
