<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of Lego Mindstorms Education, creates a package then uploads to jss</string>
	<key>Identifier</key>
	<string>com.github.sebtomasi.jss.LegoMindstormsEducation</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>EV3 Classroom</string>
        <key>DL_URL</key>
        <string>https://le-www-live-s.legocdn.com/downloads/LME-Scratch</string>
        <key>LANGUAGE_CODE</key>
        <string>en-US</string>
        <key>DESCRIPTION</key>
		<string>LEGO MINDSTORMS EV3 makes building, programming and commanding your own LEGO robots smarter, faster, and more fun than ever.</string>
		<key>CATEGORY</key>
        <string>Testing</string>
        <key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/%NAME%.png</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
        <key>pkg_path</key>
        <string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
    <key>ParentRecipe</key>
	<string>com.github.sebtomasi.pkg.LegoMindstormsEducation</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
			<key>Arguments</key>
			<dict>
				<key>input_var</key>
				<string>%target%</string>
				<key>rename_var</key>
				<string>pkg_path</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
